study12/tools/loadtest/results/study11_before__hot-post-view-comments100__capacity__run-01__k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hot-post-view.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * hot_post_view: Up to 1000.00 iterations/s for 1m20s over 4 stages (maxVUs: 100-1000, gracefulStop: 10s)


running (0m01.0s), 0081/0100 VUs, 110 complete and 0 interrupted iterations
hot_post_view   [   1% ] 0081/0100 VUs  0m01.0s/1m20s  0200.00 iters/s

running (0m02.0s), 0001/0100 VUs, 390 complete and 0 interrupted iterations
hot_post_view   [   2% ] 0001/0100 VUs  0m02.0s/1m20s  0200.00 iters/s

running (0m03.0s), 0001/0100 VUs, 590 complete and 0 interrupted iterations
hot_post_view   [   4% ] 0001/0100 VUs  0m03.0s/1m20s  0200.00 iters/s

running (0m04.0s), 0001/0100 VUs, 790 complete and 0 interrupted iterations
hot_post_view   [   5% ] 0001/0100 VUs  0m04.0s/1m20s  0200.00 iters/s

running (0m05.0s), 0001/0100 VUs, 990 complete and 0 interrupted iterations
hot_post_view   [   6% ] 0001/0100 VUs  0m05.0s/1m20s  0200.00 iters/s

running (0m06.0s), 0006/0100 VUs, 1185 complete and 0 interrupted iterations
hot_post_view   [   7% ] 0006/0100 VUs  0m06.0s/1m20s  0200.00 iters/s

running (0m07.0s), 0001/0100 VUs, 1390 complete and 0 interrupted iterations
hot_post_view   [   9% ] 0001/0100 VUs  0m07.0s/1m20s  0200.00 iters/s

running (0m08.0s), 0001/0100 VUs, 1590 complete and 0 interrupted iterations
hot_post_view   [  10% ] 0001/0100 VUs  0m08.0s/1m20s  0200.00 iters/s

running (0m09.0s), 0001/0100 VUs, 1790 complete and 0 interrupted iterations
hot_post_view   [  11% ] 0001/0100 VUs  0m09.0s/1m20s  0200.00 iters/s

running (0m10.0s), 0000/0100 VUs, 1990 complete and 0 interrupted iterations
hot_post_view   [  12% ] 0000/0100 VUs  0m10.0s/1m20s  0200.00 iters/s

running (0m11.0s), 0001/0100 VUs, 2190 complete and 0 interrupted iterations
hot_post_view   [  14% ] 0001/0100 VUs  0m11.0s/1m20s  0200.00 iters/s

running (0m12.0s), 0001/0100 VUs, 2390 complete and 0 interrupted iterations
hot_post_view   [  15% ] 0001/0100 VUs  0m12.0s/1m20s  0200.00 iters/s

running (0m13.0s), 0001/0100 VUs, 2590 complete and 0 interrupted iterations
hot_post_view   [  16% ] 0001/0100 VUs  0m13.0s/1m20s  0200.00 iters/s

running (0m14.0s), 0001/0100 VUs, 2790 complete and 0 interrupted iterations
hot_post_view   [  17% ] 0001/0100 VUs  0m14.0s/1m20s  0200.00 iters/s

running (0m15.0s), 0001/0100 VUs, 2990 complete and 0 interrupted iterations
hot_post_view   [  19% ] 0001/0100 VUs  0m15.0s/1m20s  0200.00 iters/s

running (0m16.0s), 0000/0100 VUs, 3196 complete and 0 interrupted iterations
hot_post_view   [  20% ] 0000/0100 VUs  0m16.0s/1m20s  0211.46 iters/s

running (0m17.0s), 0001/0100 VUs, 3413 complete and 0 interrupted iterations
hot_post_view   [  21% ] 0001/0100 VUs  0m17.0s/1m20s  0223.49 iters/s

running (0m18.0s), 0001/0100 VUs, 3642 complete and 0 interrupted iterations
hot_post_view   [  22% ] 0001/0100 VUs  0m18.0s/1m20s  0235.47 iters/s

running (0m19.0s), 0001/0100 VUs, 3884 complete and 0 interrupted iterations
hot_post_view   [  24% ] 0001/0100 VUs  0m19.0s/1m20s  0247.49 iters/s

running (0m20.0s), 0001/0100 VUs, 4137 complete and 0 interrupted iterations
hot_post_view   [  25% ] 0001/0100 VUs  0m20.0s/1m20s  0259.47 iters/s

running (0m21.0s), 0001/0100 VUs, 4403 complete and 0 interrupted iterations
hot_post_view   [  26% ] 0001/0100 VUs  0m21.0s/1m20s  0271.49 iters/s

running (0m22.0s), 0001/0100 VUs, 4680 complete and 0 interrupted iterations
hot_post_view   [  27% ] 0001/0100 VUs  0m22.0s/1m20s  0283.47 iters/s

running (0m23.0s), 0001/0100 VUs, 4970 complete and 0 interrupted iterations
hot_post_view   [  29% ] 0001/0100 VUs  0m23.0s/1m20s  0295.49 iters/s

running (0m24.0s), 0001/0100 VUs, 5271 complete and 0 interrupted iterations
hot_post_view   [  30% ] 0001/0100 VUs  0m24.0s/1m20s  0307.47 iters/s

running (0m25.0s), 0001/0100 VUs, 5584 complete and 0 interrupted iterations
hot_post_view   [  31% ] 0002/0100 VUs  0m25.0s/1m20s  0319.49 iters/s

running (0m26.0s), 0001/0100 VUs, 5910 complete and 0 interrupted iterations
hot_post_view   [  32% ] 0001/0100 VUs  0m26.0s/1m20s  0331.48 iters/s

running (0m27.0s), 0022/0100 VUs, 6226 complete and 0 interrupted iterations
hot_post_view   [  34% ] 0022/0100 VUs  0m27.0s/1m20s  0343.46 iters/s

running (0m28.0s), 0001/0100 VUs, 6597 complete and 0 interrupted iterations
hot_post_view   [  35% ] 0001/0100 VUs  0m28.0s/1m20s  0355.48 iters/s

running (0m29.0s), 0002/0100 VUs, 6958 complete and 0 interrupted iterations
hot_post_view   [  36% ] 0002/0100 VUs  0m29.0s/1m20s  0367.49 iters/s

running (0m30.0s), 0001/0100 VUs, 7332 complete and 0 interrupted iterations
hot_post_view   [  37% ] 0001/0100 VUs  0m30.0s/1m20s  0379.48 iters/s

running (0m31.0s), 0001/0100 VUs, 7717 complete and 0 interrupted iterations
hot_post_view   [  39% ] 0001/0100 VUs  0m31.0s/1m20s  0391.46 iters/s

running (0m32.0s), 0002/0100 VUs, 8114 complete and 0 interrupted iterations
hot_post_view   [  40% ] 0002/0100 VUs  0m32.0s/1m20s  0403.48 iters/s

running (0m33.0s), 0047/0100 VUs, 8478 complete and 0 interrupted iterations
hot_post_view   [  41% ] 0047/0100 VUs  0m33.0s/1m20s  0415.47 iters/s

running (0m34.0s), 0002/0100 VUs, 8945 complete and 0 interrupted iterations
hot_post_view   [  42% ] 0002/0100 VUs  0m34.0s/1m20s  0427.48 iters/s

running (0m35.0s), 0001/0100 VUs, 9379 complete and 0 interrupted iterations
hot_post_view   [  44% ] 0001/0100 VUs  0m35.0s/1m20s  0439.47 iters/s

running (0m36.0s), 0002/0100 VUs, 9824 complete and 0 interrupted iterations
hot_post_view   [  45% ] 0001/0100 VUs  0m36.0s/1m20s  0451.48 iters/s

running (0m37.0s), 0001/0100 VUs, 10282 complete and 0 interrupted iterations
hot_post_view   [  46% ] 0001/0100 VUs  0m37.0s/1m20s  0463.47 iters/s

running (0m38.0s), 0008/0100 VUs, 10745 complete and 0 interrupted iterations
hot_post_view   [  47% ] 0008/0100 VUs  0m38.0s/1m20s  0475.48 iters/s

running (0m39.0s), 0013/0100 VUs, 11221 complete and 0 interrupted iterations
hot_post_view   [  49% ] 0013/0100 VUs  0m39.0s/1m20s  0487.47 iters/s

running (0m40.0s), 0030/0100 VUs, 11698 complete and 0 interrupted iterations
hot_post_view   [  50% ] 0030/0100 VUs  0m40.0s/1m20s  0499.48 iters/s

running (0m41.0s), 0059/0100 VUs, 12176 complete and 0 interrupted iterations
hot_post_view   [  51% ] 0059/0100 VUs  0m41.0s/1m20s  0515.93 iters/s

running (0m42.0s), 0143/0144 VUs, 12568 complete and 0 interrupted iterations
hot_post_view   [  52% ] 0143/0144 VUs  0m42.0s/1m20s  0532.62 iters/s

running (0m43.0s), 0176/0177 VUs, 13042 complete and 0 interrupted iterations
hot_post_view   [  54% ] 0176/0177 VUs  0m43.0s/1m20s  0549.26 iters/s

running (0m44.0s), 0215/0215 VUs, 13523 complete and 0 interrupted iterations
hot_post_view   [  55% ] 0215/0215 VUs  0m44.0s/1m20s  0565.94 iters/s

running (0m45.0s), 0266/0268 VUs, 13991 complete and 0 interrupted iterations
hot_post_view   [  56% ] 0266/0268 VUs  0m45.0s/1m20s  0582.59 iters/s

running (0m46.0s), 0337/0337 VUs, 14437 complete and 0 interrupted iterations
hot_post_view   [  57% ] 0337/0337 VUs  0m46.0s/1m20s  0599.29 iters/s

running (0m47.0s), 0417/0418 VUs, 14875 complete and 0 interrupted iterations
hot_post_view   [  59% ] 0417/0418 VUs  0m47.0s/1m20s  0615.94 iters/s

running (0m48.0s), 0489/0490 VUs, 15355 complete and 0 interrupted iterations
hot_post_view   [  60% ] 0489/0490 VUs  0m48.0s/1m20s  0632.60 iters/s

running (0m49.0s), 0559/0560 VUs, 15850 complete and 0 interrupted iterations
hot_post_view   [  61% ] 0559/0560 VUs  0m49.0s/1m20s  0649.27 iters/s

running (0m50.0s), 0644/0645 VUs, 16339 complete and 0 interrupted iterations
hot_post_view   [  62% ] 0644/0645 VUs  0m50.0s/1m20s  0665.97 iters/s

running (0m51.0s), 0757/0758 VUs, 16768 complete and 0 interrupted iterations
hot_post_view   [  64% ] 0757/0758 VUs  0m51.0s/1m20s  0682.61 iters/s

running (0m52.0s), 0878/0879 VUs, 17213 complete and 0 interrupted iterations
hot_post_view   [  65% ] 0878/0879 VUs  0m52.0s/1m20s  0699.27 iters/s

running (0m53.0s), 0993/0993 VUs, 17676 complete and 0 interrupted iterations
hot_post_view   [  66% ] 0993/0993 VUs  0m53.0s/1m20s  0715.95 iters/s

running (0m54.0s), 1000/1000 VUs, 18127 complete and 0 interrupted iterations
hot_post_view   [  67% ] 1000/1000 VUs  0m54.0s/1m20s  0732.61 iters/s

running (0m55.0s), 1000/1000 VUs, 18638 complete and 0 interrupted iterations
hot_post_view   [  69% ] 1000/1000 VUs  0m55.0s/1m20s  0749.28 iters/s

running (0m56.0s), 1000/1000 VUs, 19075 complete and 0 interrupted iterations
hot_post_view   [  70% ] 1000/1000 VUs  0m56.0s/1m20s  0765.95 iters/s

running (0m57.0s), 1000/1000 VUs, 19604 complete and 0 interrupted iterations
hot_post_view   [  71% ] 1000/1000 VUs  0m57.0s/1m20s  0782.61 iters/s

running (0m58.0s), 0999/1000 VUs, 20097 complete and 0 interrupted iterations
hot_post_view   [  72% ] 1000/1000 VUs  0m58.0s/1m20s  0799.28 iters/s

running (0m59.0s), 1000/1000 VUs, 20607 complete and 0 interrupted iterations
hot_post_view   [  74% ] 1000/1000 VUs  0m59.0s/1m20s  0815.93 iters/s

running (1m00.0s), 1000/1000 VUs, 21072 complete and 0 interrupted iterations
hot_post_view   [  75% ] 1000/1000 VUs  1m00.0s/1m20s  0832.60 iters/s

running (1m01.0s), 1000/1000 VUs, 21535 complete and 0 interrupted iterations
hot_post_view   [  76% ] 1000/1000 VUs  1m01.0s/1m20s  0849.26 iters/s

running (1m02.0s), 1000/1000 VUs, 21959 complete and 0 interrupted iterations
hot_post_view   [  77% ] 1000/1000 VUs  1m02.0s/1m20s  0865.94 iters/s

running (1m03.0s), 1000/1000 VUs, 22402 complete and 0 interrupted iterations
hot_post_view   [  79% ] 1000/1000 VUs  1m03.0s/1m20s  0882.60 iters/s

running (1m04.0s), 0999/1000 VUs, 22907 complete and 0 interrupted iterations
hot_post_view   [  80% ] 0999/1000 VUs  1m04.0s/1m20s  0899.27 iters/s

running (1m05.0s), 1000/1000 VUs, 23415 complete and 0 interrupted iterations
hot_post_view   [  81% ] 1000/1000 VUs  1m05.0s/1m20s  0915.94 iters/s

running (1m06.0s), 1000/1000 VUs, 23897 complete and 0 interrupted iterations
hot_post_view   [  82% ] 1000/1000 VUs  1m06.0s/1m20s  0932.62 iters/s

running (1m07.0s), 1000/1000 VUs, 24300 complete and 0 interrupted iterations
hot_post_view   [  84% ] 1000/1000 VUs  1m07.0s/1m20s  0949.25 iters/s

running (1m08.0s), 1000/1000 VUs, 24544 complete and 0 interrupted iterations
hot_post_view   [  85% ] 1000/1000 VUs  1m08.0s/1m20s  0965.94 iters/s

running (1m09.0s), 1000/1000 VUs, 24965 complete and 0 interrupted iterations
hot_post_view   [  86% ] 1000/1000 VUs  1m09.0s/1m20s  0982.61 iters/s

running (1m10.0s), 1000/1000 VUs, 25455 complete and 0 interrupted iterations
hot_post_view   [  87% ] 1000/1000 VUs  1m10.0s/1m20s  0999.27 iters/s

running (1m11.0s), 0999/1000 VUs, 25918 complete and 0 interrupted iterations
hot_post_view   [  89% ] 0999/1000 VUs  1m11.0s/1m20s  0904.27 iters/s

running (1m12.0s), 0999/1000 VUs, 26308 complete and 0 interrupted iterations
hot_post_view   [  90% ] 0999/1000 VUs  1m12.0s/1m20s  0804.42 iters/s

running (1m13.0s), 1000/1000 VUs, 26758 complete and 0 interrupted iterations
hot_post_view   [  91% ] 1000/1000 VUs  1m13.0s/1m20s  0704.34 iters/s

running (1m14.0s), 0999/1000 VUs, 27242 complete and 0 interrupted iterations
hot_post_view   [  92% ] 0999/1000 VUs  1m14.0s/1m20s  0604.40 iters/s

running (1m15.0s), 0997/1000 VUs, 27710 complete and 0 interrupted iterations
hot_post_view   [  94% ] 0997/1000 VUs  1m15.0s/1m20s  0504.28 iters/s

running (1m16.0s), 0921/1000 VUs, 28240 complete and 0 interrupted iterations
hot_post_view   [  95% ] 0921/1000 VUs  1m16.0s/1m20s  0404.35 iters/s

running (1m17.0s), 0751/1000 VUs, 28764 complete and 0 interrupted iterations
hot_post_view   [  96% ] 0751/1000 VUs  1m17.0s/1m20s  0304.47 iters/s

running (1m18.0s), 0464/1000 VUs, 29306 complete and 0 interrupted iterations
hot_post_view   [  97% ] 0464/1000 VUs  1m18.0s/1m20s  0204.21 iters/s

running (1m19.0s), 0083/1000 VUs, 29841 complete and 0 interrupted iterations
hot_post_view   [  99% ] 0083/1000 VUs  1m19.0s/1m20s  0104.40 iters/s

running (1m20.0s), 0000/1000 VUs, 29978 complete and 0 interrupted iterations
hot_post_view   [ 100% ] 0000/1000 VUs  1m20.0s/1m20s  0007.07 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 29979   374.645036/s
    checks_succeeded...: 100.00% 29979 out of 29979
    checks_failed......: 0.00%   0 out of 29979

    ✓ status is 200

    CUSTOM
    http_status_200................: 29979  374.645036/s

    HTTP
    http_req_duration..............: avg=1.01s min=1.94ms med=779.76ms p(90)=2.24s p(95)=2.36s p(99)=2.87s max=3.3s
      { expected_response:true }...: avg=1.01s min=1.94ms med=779.76ms p(90)=2.24s p(95)=2.36s p(99)=2.87s max=3.3s
    http_req_failed................: 0.00%  0 out of 29979
    http_reqs......................: 29979  374.645036/s

    EXECUTION
    dropped_iterations.............: 9271   115.858906/s
    iteration_duration.............: avg=1.01s min=1.98ms med=779.83ms p(90)=2.24s p(95)=2.36s p(99)=2.87s max=3.3s
    iterations.....................: 29979  374.645036/s
    vus............................: 0      min=0          max=1000
    vus_max........................: 1000   min=100        max=1000

    NETWORK
    data_received..................: 571 MB 7.1 MB/s
    data_sent......................: 8.0 MB 100 kB/s



running (1m20.0s), 0000/1000 VUs, 29979 complete and 0 interrupted iterations
hot_post_view ✓ [ 100% ] 0000/1000 VUs  1m20s  0007.07 iters/s